In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1,2,3,4,5])

In [3]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
type(s)

pandas.core.series.Series

In [5]:
#pd.date.core.series.Serise

In [6]:
dates = pd.date_range('2020-02-10',periods=7)

In [7]:
dates

DatetimeIndex(['2020-02-10', '2020-02-11', '2020-02-12', '2020-02-13',
               '2020-02-14', '2020-02-15', '2020-02-16'],
              dtype='datetime64[ns]', freq='D')

#주석

### 마크다운

In [8]:
df = pd.DataFrame(np.random.randn(7, 2), index=dates, columns=['A','B'])
df

                   A         B
2020-02-10  0.823971 -0.319381
2020-02-11  0.448202 -0.931612
2020-02-12 -1.097984  1.837175
2020-02-13 -0.638379  0.570626
2020-02-14  1.169133 -0.068433
2020-02-15 -0.159869  0.297718
2020-02-16  1.530979 -0.346076

In [9]:
df = pd.DataFrame(np.random.randint(10,20, size=(7,2)), index=dates, columns=['A', 'B'])
df

             A   B
2020-02-10  18  13
2020-02-11  12  19
2020-02-12  15  19
2020-02-13  16  12
2020-02-14  16  19
2020-02-15  18  10
2020-02-16  17  19

In [10]:
df2 = pd.DataFrame(np.random.randint(1,101, size=(7,4)), columns=['A', 'B', 'C', 'D'])
df2

     A   B   C   D
0   97  15  50  56
1   15   2  23   5
2   39  58  29   2
3   59  88  80  89
4  100  25  90  79
5   99  78  61  98
6   10  24  79  66

### Quiz 1~100 사이 7행 4열 정수 데이터 프레임

In [11]:
pd.DataFrame(np.random.randint(1,101, size=(7,4)), columns=['A', 'B', 'C', 'D'])

    A   B   C   D
0  24  14  99  14
1  64  40  92  36
2  20  41  19  40
3  29  42  59  90
4  39  51  68  87
5  66  63   7  44
6   6  53  51  47

In [12]:
#인덱스 설명
df.index

DatetimeIndex(['2020-02-10', '2020-02-11', '2020-02-12', '2020-02-13',
               '2020-02-14', '2020-02-15', '2020-02-16'],
              dtype='datetime64[ns]', freq='D')

In [13]:
#컬럼, 데이터타입
df.columns

Index(['A', 'B'], dtype='object')

In [14]:
#n-array 값
df.values

array([[18, 13],
       [12, 19],
       [15, 19],
       [16, 12],
       [16, 19],
       [18, 10],
       [17, 19]])

In [15]:
# 평균, 표준편차 등
df.describe()

               A          B
count   7.000000   7.000000
mean   16.000000  15.857143
std     2.081666   4.017817
min    12.000000  10.000000
25%    15.500000  12.500000
50%    16.000000  19.000000
75%    17.500000  19.000000
max    18.000000  19.000000

In [16]:
# 내립차순 정렬
df.sort_values(by='A', ascending=False)

             A   B
2020-02-10  18  13
2020-02-15  18  10
2020-02-16  17  19
2020-02-13  16  12
2020-02-14  16  19
2020-02-12  15  19
2020-02-11  12  19

In [17]:
df

             A   B
2020-02-10  18  13
2020-02-11  12  19
2020-02-12  15  19
2020-02-13  16  12
2020-02-14  16  19
2020-02-15  18  10
2020-02-16  17  19

In [18]:
#n-array 값
df.values

array([[18, 13],
       [12, 19],
       [15, 19],
       [16, 12],
       [16, 19],
       [18, 10],
       [17, 19]])

In [19]:
df['A']

2020-02-10    18
2020-02-11    12
2020-02-12    15
2020-02-13    16
2020-02-14    16
2020-02-15    18
2020-02-16    17
Freq: D, Name: A, dtype: int32

In [20]:
df2[0:4]

    A   B   C   D
0  97  15  50  56
1  15   2  23   5
2  39  58  29   2
3  59  88  80  89

In [21]:
df[1:2]

             A   B
2020-02-11  12  19

In [22]:
df

             A   B
2020-02-10  18  13
2020-02-11  12  19
2020-02-12  15  19
2020-02-13  16  12
2020-02-14  16  19
2020-02-15  18  10
2020-02-16  17  19

In [23]:
df[3:5]

             A   B
2020-02-13  16  12
2020-02-14  16  19

In [24]:
df.loc['2020-02-13',['A','B']]

A    16
B    12
Name: 2020-02-13 00:00:00, dtype: int32

In [25]:
df2.loc[1,['A','B']]

A    15
B     2
Name: 1, dtype: int32

In [26]:
df.loc['2020-02-13':'2020-02-17',['A']]

             A
2020-02-13  16
2020-02-14  16
2020-02-15  18
2020-02-16  17

In [27]:
# df.iloc 인덱스와 컬럼 이름을 무시, 모두 숫자로
df.iloc[:,[0]]

             A
2020-02-10  18
2020-02-11  12
2020-02-12  15
2020-02-13  16
2020-02-14  16
2020-02-15  18
2020-02-16  17

In [28]:
df.iloc[:,[0,1]]

             A   B
2020-02-10  18  13
2020-02-11  12  19
2020-02-12  15  19
2020-02-13  16  12
2020-02-14  16  19
2020-02-15  18  10
2020-02-16  17  19

In [29]:
df.iloc[0:2,[0,1]]

             A   B
2020-02-10  18  13
2020-02-11  12  19

In [30]:
df.A

2020-02-10    18
2020-02-11    12
2020-02-12    15
2020-02-13    16
2020-02-14    16
2020-02-15    18
2020-02-16    17
Freq: D, Name: A, dtype: int32

In [31]:
df[df.A>15]

             A   B
2020-02-10  18  13
2020-02-13  16  12
2020-02-14  16  19
2020-02-15  18  10
2020-02-16  17  19

In [32]:
df.apply(lambda x : x.max() -x.min())

A    6
B    9
dtype: int64

In [33]:
df.apply(np.cumsum)

              A    B
2020-02-10   18   13
2020-02-11   30   32
2020-02-12   45   51
2020-02-13   61   63
2020-02-14   77   82
2020-02-15   95   92
2020-02-16  112  111